{"backend": "tensorflow", "keras_version": "2.0.2", "config": {"layers": [{"name": "main_input", "config": {"sparse": false, "batch_input_shape": [null, 100], "dtype": "float32", "name": "main_input"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding", "config": {"embeddings_constraint": null, "activity_regularizer": null, "input_length": 100, "embeddings_regularizer": null, "batch_input_shape": [null, 100], "output_dim": 20, "mask_zero": false, "trainable": true, "input_dim": 5000, "dtype": "int32", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "name": "embedding"}, "class_name": "Embedding", "inbound_nodes": [[["main_input", 0, 0, {}]]]}, {"name": "dropout", "config": {"trainable": true, "rate": 0.0, "name": "dropout"}, "class_name": "Dropout", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "conv1d_1", "config": {"kernel_regularizer": null, "activation": "relu", "dilation_rate": [1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 100, 20], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "strides": [1], "dtype": "float32", "use_bias": true, "filters": 1200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3], "name": "conv1d_1"}, "class_name": "Conv1D", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "conv1d_2", "config": {"kernel_regularizer": null, "activation": "relu", "dilation_rate": [1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 100, 20], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "strides": [1], "dtype": "float32", "use_bias": true, "filters": 1200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [5], "name": "conv1d_2"}, "class_name": "Conv1D", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "conv1d_3", "config": {"kernel_regularizer": null, "activation": "relu", "dilation_rate": [1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 100, 20], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "padding": "valid", "activity_regularizer": null, "strides": [1], "dtype": "float32", "use_bias": true, "filters": 1200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [7], "name": "conv1d_3"}, "class_name": "Conv1D", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"name": "max_pooling1d_1", "config": {"trainable": true, "pool_size": [98], "padding": "valid", "strides": [98], "name": "max_pooling1d_1"}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "max_pooling1d_2", "config": {"trainable": true, "pool_size": [96], "padding": "valid", "strides": [96], "name": "max_pooling1d_2"}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "max_pooling1d_3", "config": {"trainable": true, "pool_size": [94], "padding": "valid", "strides": [94], "name": "max_pooling1d_3"}, "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"name": "flatten_3", "config": {"trainable": true, "name": "flatten_3"}, "class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"trainable": true, "rate": 0.0, "name": "dropout_1"}, "class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}], ["flatten_3", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "class_name": "Concatenate", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_1", 0, 1, {}], ["dropout_1", 0, 2, {}]]]}, {"name": "output", "config": {"kernel_regularizer": null, "activation": "sigmoid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 3600], "bias_constraint": null, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "output"}, "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["main_input", 0, 0]], "output_layers": [["output", 0, 0]]}, "class_name": "Model"}